web/app/controllers/noticias_controller.rb

  def index
    @noticias = Noticia.all
---
SELECT * FROM `noticias`

  def show
    @noticia = Noticia.find(params[:id])
---
SELECT * FROM `noticias` WHERE (`noticias`.`id` = 1)

  def edit
    @noticia = Noticia.find(params[:id])
---
SELECT * FROM `noticias` WHERE (`noticias`.`id` = 1)

  def create
    @noticia = Noticia.new(params[:noticia])

    respond_to do |format|
      if @noticia.save
---
INSERT INTO `noticias` (`image_url`, `updated_at`, `autor`, `titular`, `cuerpo`, `created_at`) VALUES('-', '2010-07-23 15:12:04', 'Mario', 'Diego es gayer', 'Efectivamente, fuentes cercanas nos han confirmado en el día de hoy que Diego Rivera es un poco gayer... Señores de la zona, ¡Esta es su oportunidad!', '2010-07-23 15:12:04')

  def update
    @noticia = Noticia.find(params[:id])

    respond_to do |format|
      if @noticia.update_attributes(params[:noticia])
---
SELECT * FROM `noticias` WHERE (`noticias`.`id` = 3)
UPDATE `noticias` SET `updated_at` = '2010-08-09 17:57:16', `cuerpo` = 'El próximo día 23 de Septiembre, Fiura dará un concierto en la sala Óxido. Os esperamos allí a todos!', `titular` = 'Fiura en concierto!' WHERE `id` = 3

  def destroy
    @noticia = Noticia.find(params[:id])
    @noticia.destroy
---
SELECT * FROM `noticias` WHERE (`noticias`.`id` = 2)
DELETE FROM `noticias` WHERE `id` = 2